app/models/article.rb

    def tag_list=(tags_string)
        tag_names = tags_string.split(',').collect{|s| s.strip.downcase}.uniq
        new_or_found_tags = tag_names.collect {|name| Tag.find_or_create_by(name: name)}
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "cat picture"], ["created_at", "2020-01-11 14:48:41.006972"], ["updated_at", "2020-01-11 14:48:41.006972"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "tag1"], ["LIMIT", 1]]